Repository: annasabater/TFG_Frontend
Catalog: lib/l10n/app_*.arb
Languages: ca

# warControls
source: Controls: Player 1: WASD + Space Player 2: Arrows + Enter
ca: Controls: Jugador 1: WASD + Espai Jugador 2: Fletxes + Enter

# asteroidRainHeading
source: Asteroid Rain!
ca: ¡Pluja d’Asteroides!

# asteroidRainDescription
source: Dodge the asteroids, collect hearts and survive
ca: Esquiva les roques, recull cors i sobreviu

# asteroidRainPlayButton
source: Play
ca: Jugar

# playAgainButton
source: Play Again
ca: Tornar a jugar

# backButton
source: Back
ca: Enrere

# dodgeDescription
source: Dodge rocks, collect hearts and survive
ca: Esquiva les roques, recull cors i sobreviu

# finalScoreLabel
source: Final Score: {score}
ca: Puntuació final: {score}

# addButton
source: Add
ca: Afegir

# deleteButton
source: Delete
ca: Esborrar

# createUserHint
source: Create a user in the "Create User" section or refresh from the sidebar
ca: Crea un usuari a la secció "Crear usuari" o actualitza des de la barra lateral

# confirmTitle
source: Confirm
ca: Confirmar

# confirmContent
source: Are you sure you want to delete user {userName}?
ca: Estàs segur que vols esborrar l'usuari {userName}?

# userDeletedSuccess
source: User {userName} has been deleted
ca: L'usuari {userName} ha estat esborrat

# userDeletedError
source: Could not delete user: {error}
ca: No s'ha pogut esborrar l'usuari: {error}
