Repository: annasabater/TFG_Frontend
Catalog: lib/l10n/app_*.arb
Languages: ca

source: Login
ca: Iniciar Sessió

source: Register
ca: Registrar

source: Email
ca: Correu Electrònic

source: Password
ca: Contrasenya

source: Confirm Password
ca: Confirmar Contrasenya

source: Username
ca: Nom d'Usuari

source: Submit
ca: Enviar

source: Cancel
ca: Cancel·lar

source: Edit
ca: Editar

source: Delete
ca: Eliminar

# deleteConfirm
source: Are you sure you want to delete this post?
ca: Segur que vols eliminar la publicació?

source: Accept
ca: Acceptar

source: Comments
ca: Comentaris

# noComments
source: No comments yet
ca: Encara no hi ha comentaris

source: Spectate Games
ca: Veure Partides

source: Success
ca: Èxit

source: Welcome
ca: Benvingut

source: Log Out
ca: Tancar sessió

source: Settings
ca: Configuració

source: Language
ca: Idioma

source: Light Mode
ca: Mode Clar

source: Dark Mode
ca: Mode fosc

source: Home
ca: Inici

source: Users
ca: Usuaris

source: Create User
ca: Crear Usuari

source: Delete User
ca: Eliminar Usuari

source: Profile
ca: Perfil

source: Games
ca: Jocs

source: Admin Details
ca: Detalls Admin

source: Social Network
ca: Xarxa Social

source: Chat
ca: Xat

source: Map
ca: Mapa

source: Store
ca: Botiga

source: Play Testing
ca: Proves de Joc

# welcomeMessage
source: Welcome to SkyNet
ca: Benvinguts a SkyNet

# appDescription
source: SkyNet is an all-in-one platform offering multiplayer games, real-time chat, social networking features and a marketplace for buying and selling drones and services, all powered by a MongoDB backend.
ca: SkyNet és una plataforma tot-en-un que inclou jocs multijugador, xat en temps real, funcions de xarxa social i un mercat de compra-venda de drons i serveis, tot gestionat amb un backend MongoDB.

# features
source: Available Modules
ca: Mòduls disponibles

# gamesFeatureTitle
source: Multiplayer Games
ca: Jocs multijugador

# gamesFeatureDescription
source: Join sessions and compete with friends over real-time sockets.
ca: Uneix-t’hi i competeix amb amics mitjançant sockets en temps real.

# chatFeatureTitle
source: Real-Time Chat
ca: Xat en temps real

# chatFeatureDescription
source: Instant messaging in channels or private conversations.
ca: Missatgeria instantània en canals o converses privades.

# socialFeatureTitle
source: Social Network
ca: Xarxa social

# socialFeatureDescription
source: Follow profiles, post updates and engage with the community.
ca: Segueix perfils, publica actualitzacions i interactua amb la comunitat.

# storeFeatureTitle
source: Store & Marketplace
ca: Botiga i mercat

# storeFeatureDescription
source: Buy, sell or rent drones and gear, with favorites, reviews and ad management.
ca: Compra, ven o lloga drons i material, amb favorits, ressenyes i gestió d’anuncis.

# emptyFieldsError
source: Please fill in all fields.
ca: Si us plau, omple tots els camps.

source: OK
ca: D'acord

source: Forgot Password?
ca: Has oblidat la Contrasenya?

source: Role
ca: Rol

# roleAdministrator
source: Administrator
ca: Administrador

# roleUser
source: User
ca: Usuari

# roleCompany
source: Company
ca: Empresa

# roleGovernment
source: Government
ca: Govern

source: Not a member?
ca: Encara no ets membre?

source: Stock
ca: Estoc

# noStock
source: Out of stock
ca: Sense estoc

# fewStock
source: Few left!
ca: Pocs!

# newLabel
source: New
ca: Nou

source: Filters
ca: Filtres

source: Search and price
ca: Cerca i preu

source: Search by name
ca: Cerca per nom

# minPrice
source: Minimum price
ca: Preu mínim

# maxPrice
source: Maximum price
ca: Preu màxim

source: Category and condition
ca: Categoria i condició

source: Category
ca: Categoria

source: Select category
ca: Selecciona categoria

source: Condition
ca: Condició

source: Select condition
ca: Selecciona condició

source: Apply filters
ca: Aplicar filtres

# resetFilters
source: Reset
ca: Reiniciar

# editDrone
source: Edit listing
ca: Editar anunci

source: Sale
ca: Venta

source: Rental
ca: Lloguer

# usedLabel
source: Used
ca: Usat

# addImage
source: Add image ({count}/4)
ca: Afegir imatge ({count}/4)

source: Save changes
ca: Desar canvis

source: Edit post
ca: Editar publicació

source: Description
ca: Descripció

# noFollowedPosts
source: No posts from people you follow
ca: Sense publicacions de qui segueixes

# noOtherUserPosts
source: No posts from other users
ca: Sense publicacions d'altres usuaris

# nowFollowing
source: You are now following this user
ca: Ara segueixes aquest usuari

# unfollowed
source: You have unfollowed this user
ca: Has deixat de seguir aquest usuari

# followingAndSearch
source: Following and search users
ca: Seguits i cerca d'usuaris

source: Search users...
ca: Cerca usuaris...

# followingCount
source: You follow {count, plural, one{user} other{users}}
ca: Segueixes {count, plural, one{usuari} other{usuaris}}

# notFollowingAnyone
source: You are not following anyone.
ca: No segueixes ningú.

source: Publishing…
ca: Publicant…

source: Publish
ca: Publicar

source: Choose photo
ca: Escollir foto

source: New post
ca: Nova publicació

source: Location
ca: Ubicació

source: Following
ca: Seguint

source: Follow
ca: Seguir

# errorLoadingProfile
source: Error loading profile: {error}
ca: Error en carregar el perfil: {error}

# unfollowTitle
source: Unfollow
ca: Deixar de seguir

# unfollowConfirm
source: Do you want to unfollow {user}?
ca: Vols deixar de seguir a {user}?

source: Yes
ca: Sí

source: Unfollow
ca: Deixar de seguir

# errorFollowAction
source: Error while {action}: {error}
ca: Error en {action}: {error}

source: Message
ca: Missatge

# errorSendingComment
source: Error sending comment: {error}
ca: Error enviant comentari: {error}

# deleteCommentTitle
source: Delete comment
ca: Eliminar comentari

# deleteCommentConfirm
source: Are you sure you want to delete this comment?
ca: Segur que vols eliminar aquest comentari?

# errorDeletingComment
source: Error deleting comment: {error}
ca: Error eliminant comentari: {error}

# likesCount
source: {count} likes
ca: {count} m'agrada

source: See following
ca: Veure seguits

# exploreTab
source: EXPLORE
ca: EXPLORA

# followingTab
source: FOLLOWING
ca: SEGUINT

# cannotBuyOwnDrone
source: You cannot buy your own drone
ca: No pots comprar el teu dron

# addToCart
source: Add
ca: Afegir

# ownDrone
source: This drone is yours
ca: Aquest dron és teu

# daltonicMode
source: Color-blind Mode
ca: Mode daltonic

source: Reading Mode
ca: Mode lectura

# mandatoryField
source: Required
ca: Obligatori

source: Invalid price
ca: Preu invàlid

source: Currency not allowed
ca: Divisa no permesa

# addDroneImage
source: Add image ({count}/4)
ca: Afegir imatge ({count}/4)

# droneCreatedSuccess
source: Listing created successfully
ca: Anunci creat amb èxit

# droneCreationError
source: Error creating listing
ca: Error en crear l’anunci

# listingTitle
source: Title
ca: Títol

# listingDescription
source: Description
ca: Descripció

# priceLabel
source: Price
ca: Preu

# currencyLabel
source: Currency
ca: Divisa

# locationLabel
source: Location
ca: Localització

# categoryLabel
source: Category
ca: Categoria

# conditionLabel
source: Condition
ca: Condició

# contactLabel
source: Contact
ca: Contacte

# newCondition
source: New
ca: Nou

# usedCondition
source: Used
ca: Usat

source: Create listing
ca: Crear anunci

# storeTitle
source: Drone Store
ca: Tenda de drons

source: View navigation
ca: Veure navegació

source: View filters
ca: Veure filtres

source: Navigation
ca: Navegació

# showLabel
source: Show:
ca: Mostrar:

# pageLabel
source: Page {page}
ca: Pàgina {page}

# loadErrorDrones
source: Error loading drones: {error}
ca: Error carregant drons: {error}

# changeItemsError
source: Error changing number of items: {error}
ca: Error canviant nombre d’elements: {error}

source: No listings
ca: No hi ha anuncis

# removeFavorite
source: Remove from favorites
ca: Treure de favorits

# addFavorite
source: Add to favorites
ca: Afegir a favorits

source: Purchase
ca: Compra

source: Purchase confirmed!
ca: Compra confirmada!

# purchaseFailed
source: Could not complete the purchase.
ca: No s’ha pogut fer la compra.

source: Insufficient balance
ca: Saldo insuficient

source: New review
ca: Nova ressenya

# shippingDetailsTitle
source: Shipping details
ca: Dades d’enviament

source: Full address
ca: Adreça completa

# phoneLabel
source: Phone
ca: Telèfon

source: Confirm
ca: Confirmar

# addReviewTitle
source: Add a review
ca: Afegeix una ressenya

# ratingStars
source: {count} stars
ca: {count} estrelles

# reviewLabel
source: Comment
ca: Comentari

source: Send
ca: Enviar

# searchModelLocationHint
source: Search by model, location…
ca: Cerca per model, ubicació…

# youAreSeller
source: You are the seller
ca: Ets l’anunciant

# chatWithCreator
source: Chat with the creator
ca: Xat amb el creador

# noMyListings
source: You have no listings yet
ca: Encara no tens anuncis

source: Edit listing
ca: Editar anunci

# deleteListingTitle
source: Delete listing
ca: Eliminar anunci

# deleteListingConfirm
source: Are you sure you want to delete this listing?
ca: Segur que vols borrar aquest anunci?

source: Listing deleted
ca: Anunci eliminat

source: Error deleting listing
ca: Error en eliminar anunci

source: View details
ca: Veure detalls

source: No favorites
ca: Sense favorits

# addToCartTooltip
source: Add to cart
ca: Afegir al carret

source: Out of stock
ca: Sense stock

source: Added to cart
ca: Afegit al carret

source: Listing updated
ca: Anunci actualitzat

# errorUpdatingListing
source: Error updating listing: {error}
ca: Error en actualitzar anunci: {error}

# searchUsersHint
source: Search users…
ca: Buscar usuaris…

# writeCommentHint
source: Write a comment…
ca: Escriu un comentari…

# descriptionLabel
source: Description
ca: Descripció

# deleteUsersTitle
source: Delete Users
ca: Esborrar usuaris

# deleteUsersDescription
source: Tap any user card to remove that user from the system.
ca: Fes clic a qualsevol targeta d'usuari per eliminar-lo del sistema.

source: No users to delete
ca: No hi ha usuaris per esborrar

# createOrReloadUsersHint
source: Create a user under “Create User” or reload users from the sidebar
ca: Crea un usuari a “Crear usuari” o actualitza els usuaris des de la barra lateral

# deleteUserConfirmationTitle
source: Confirm
ca: Confirmar

# deleteUserConfirmationContent
source: Are you sure you want to delete user {userName}?
ca: Estàs segur que vols eliminar l’usuari {userName}?

# cancelButton
source: Cancel
ca: Cancel·lar

# confirmDeleteButton
source: Delete
ca: Esborrar

# deleteSuccessSnack
source: User {userName} has been deleted
ca: L’usuari {userName} ha estat eliminat

# deleteErrorSnack
source: Could not delete user: {error}
ca: No s’ha pogut eliminar l’usuari: {error}

# noIdDeleteErrorSnack
source: Cannot delete a user without an ID
ca: No es pot esborrar un usuari sense ID

# chatsTitle
source: Chats
ca: Xats

# noConversations
source: You don’t have any conversations yet.
ca: Encara no tens converses.

# notLoggedIn
source: You are not logged in
ca: No estàs loguejat

# writeMessageHint
source: Write a message…
ca: Escriu un missatge…

# usersStatsTitle
source: User Statistics
ca: Estadístiques d’usuaris

# userListTitle
source: User List
ca: Llista d'usuaris

source: No users found
ca: No s'han trobat usuaris

# errorLoadingDrones
source: Error loading drones: {error}
ca: Error carregant drons: {error}

# editProfileTitle
source: Edit Profile
ca: Editar Perfil

# nameHint
source: Name
ca: Nom

# newPasswordHint
source: New Password
ca: Nova contrasenya

# passwordMinLength
source: Min 8 characters
ca: Mínim 8 caràcters

# passwordMaxLength
source: Max 20 characters
ca: Màxim 20 caràcters

# passwordLowercase
source: At least one lowercase letter
ca: Almenys una minúscula

# passwordUppercase
source: At least one uppercase letter
ca: Almenys una majúscula

# passwordNumber
source: At least one number
ca: Almenys un número

# passwordSpecial
source: At least one special character
ca: Almenys un caràcter especial

# updateProfileButton
source: Update Profile
ca: Actualitzar Perfil

# deleteAccountButton
source: Delete Account
ca: Eliminar compte

# deleteAccountError
source: Could not delete account: {error}
ca: No s’ha pogut eliminar el compte: {error}

# createUserTitle
source: Create New User
ca: Crear nou usuari

# createUserDescription
source: Fill out the form to add a new user to the system.
ca: Omple el formulari per afegir un nou usuari al sistema.

# usernameField
source: Username
ca: Nom d’usuari

# emailField
source: Email
ca: Correu electrònic

# passwordField
source: Password
ca: Contrasenya

# roleField
source: Role
ca: Rol

# createUserButton
source: Create User
ca: Crear usuari

# userCreatedSnack
source: User created successfully!
ca: Usuari creat correctament!

# mapsTitle
source: Drone Map
ca: Mapa de Drones

# googleMapsApiKeyError
source: Google Maps API key not found
ca: No s’ha trobat la clau API de Google Maps

# locationServicesDisabled
source: Location services are disabled
ca: Els serveis de ubicació estan desactivats

source: Location permission denied
ca: Permisos de ubicació denegats

# locationPermissionDeniedForever
source: Location permission permanently denied
ca: Permisos de ubicació permanentment denegats

# currentLocationMarker
source: My Location
ca: La meva ubicació

# searchPlaceHint
source: Search location…
ca: Buscar ubicació…

# searchError
source: Search error: {error}
ca: Error en la cerca: {error}

# noSearchResults
source: No results found
ca: No s’han trobat resultats

# mapCenterButton
source: Center Map
ca: Centre del mapa

# homeTitle
source: Home
ca: Inici

# featuresSectionTitle
source: Available Modules
ca: Mòduls disponibles

# printTitle
source: Print
ca: Imprimir

# gamesPageTitle
source: Games
ca: Jocs

# descriptionButton
source: Description
ca: Descripció

# accessDeniedTitle
source: Access Denied
ca: Accés denegat

# enterButton
source: Enter
ca: Entrar

# gameManualDialogTitle
source: Game Manual
ca: Manual del joc

# droneBattleTitle
source: Drone Battle
ca: Guerra de Drons

# droneBattleWelcome
source: Drone Battle!
ca: ¡Batalla de Drons!

# droneBattleControls
source: Controls: Player 1: WASD + Space Player 2: Arrows + Enter
ca: Controls: Jugador 1: WASD + Espai Jugador 2: Fletxes + Enter

# droneBattleStartButton
source: Start Game
ca: Començar Joc

# droneBattlePlayAgainButton
source: Play Again
ca: Tornar a jugar

# guerraDronsTitle
source: Drone War
ca: Guerra de Drons

# guerraDronsWelcome
source: Drone War!
ca: Guerra de Drons!

# guerraDronsControls
source: Controls: Player 1: WASD + Space Player 2: Arrows + Enter
ca: Controls: Jugador 1: WASD + Espai Jugador 2: Fletxes + Enter

# guerraDronsStartButton
source: Start Game
ca: Començar Joc

# menuMiniGamesTitle
source: Mini Games
ca: Mini Jocs

# menuMiniGamesAsteroids
source: Asteroid Rain
ca: Pluja d'Asteroides

# menuMiniGamesBattle
source: Drone War
ca: Guerra de Drons

# playTestingDodge
source: Drone Dodge
ca: Dron Dodge

# playTestingBattle
source: Drone Battle
ca: Batalla de Drons

# asteroidRainTitle
source: Asteroid Rain
ca: Pluja d’Asteroides

# asteroidRainWelcome
source: Asteroid Rain! Dodge rocks, collect hearts and survive
ca: Pluja d'Asteroides! Esquiva les roques, recull cors i sobreviu

# asteroidRainStartButton
source: PLAY
ca: JUGAR

# dodgeTitle
source: Drone Dodge
ca: Dron Dodge

# dodgeWelcome
source: Dodge the rocks, collect hearts and survive
ca: Esquiva les roques, recull cors i sobreviu

# dodgeStartButton
source: PLAY
ca: JUGAR

# gamesTitle
source: Games
ca: Jocs

# closeButton
source: Close
ca: Tancar

# combatMode
source: COMBAT
ca: Mode Combat

# createNewUserTitle
source: Create New User
ca: Crear nou usuari

# createNewUserDescription
source: Fill the form to add a new user to the system.
ca: Omple el formulari per afegir un nou usuari al sistema.

# usernameLabel
source: Username
ca: Nom d'usuari

# usernameEmptyError
source: Username cannot be empty
ca: Cal omplir el nom d'usuari

# emailLabel
source: Email
ca: Correu electrònic

# emailEmptyError
source: Email cannot be empty
ca: El correu electrònic no pot estar buit

# emailInvalidError
source: Please enter a valid email address
ca: Si us plau, insereix una adreça vàlida

# passwordLabel
source: Password
ca: Contrasenya

# passwordEmptyError
source: Password cannot be empty
ca: La contrasenya no pot estar buida

# passwordLengthError
source: Password must be at least 6 characters
ca: La contrasenya ha de tenir almenys 6 caràcters

# roleLabel
source: Role
ca: Rol

# roleEmptyError
source: Please specify a role
ca: Cal especificar un rol

# userCreatedSuccess
source: User created successfully!
ca: Usuari creat correctament!

# usersStatisticsTitle
source: User Statistics
ca: Estadístiques d'usuaris

# uniqueRolesLabel
source: Unique Roles
ca: Rols únics

# startGameButton
source: Start Game
ca: Començar Joc

# winnerMessage
source: {winner} Wins!
ca: ¡{winner} Guanya!

# warTitle
source: Drone Warfare
ca: Guerra de Drons

# warStartButton
source: Start Battle
ca: Començar Batalla

# menuDodge
source: Drone Dodge
ca: Dron Dodge

# menuBattle
source: Drone Battle
ca: Batalla de Drons

# searchHint
source: Search place…
ca: Buscar lloc…

source: Retry
ca: Reintentar

# mapTitle
source: Map
ca: Mapa

# filterLabel
source: Filter zones by color:
ca: Filtrar zones per color:

# zoneRestricted
source: Restricted Zone
ca: Zona Restringida

# zonePermitted
source: Permitted Zone
ca: Zona Permitida

# zoneRegulated
source: Regulated Zone
ca: Zona Regulada

# zoneAll
source: Show all zones
ca: Mostrar totes les zones

# waitingRoomTitle
source: Waiting Room
ca: Sala d'espera

# waitingRoomMessage
source: Waiting for the teacher to start the game…
ca: Esperant que el professor iniciï la partida…

# spectateNoGameTitle
source: ⚠️ No game has started yet
ca: ⚠️ Encara no s'ha iniciat cap partida

# spectateWaitingMessage
source: Waiting for the teacher to start the game…
ca: Esperant que el professor iniciï la partida…

# spectateMiniGameButton
source: Mini Game
ca: Mini Joc

# spectateGameOverTitle
source: GAME OVER
ca: PARTIDA FINALITZADA

# spectateGoHome
source: Go Home
ca: Anar a l'inici

# gameDescription
source: 📜 Game Description The drone game is a competitive experience designed to challenge players’ skills in a dynamic battlefield. Participants control their drones with precision, strategy, and speed to eliminate opponents and survive amid obstacles. The goal is to be the last drone standing or accumulate the highest score, depending on the selected mode. ───────────────────────────────────────────────────────── 🕹 Available Modes • Players: 2 to 4 • Modes: Free-for-all (last man standing), 2 vs 2 (respawn enabled) • Time Limit: 8 minutes ───────────────────────────────────────────────────────── 🚀 Weapons & Dynamics • Small Fast Bullet → High fire rate, ~800 m/s • Medium Bullet → Balanced damage/speed, ~500 m/s • Large Slow Bullet → Heavy damage, ~100 m/s ───────────────────────────────────────────────────────── 🎯 Victory Conditions • 10 points per drone eliminated • 1 point per obstacle destroyed ───────────────────────────────────────────────────────── “An immersive experience where strategy and skill collide in thrilling drone battles.”
ca: 📜 Descripció del Joc El joc és una competició de drons dissenyada per desafiar les habilitats dels jugadors en un entorn de combat dinàmic i competitiu. Els participants controlen els seus drons amb precisió, estratègia i rapidesa per eliminar oponents i sobreviure en un camp de batalla amb obstacles. L’objectiu és ser l’últim dron en peu o acumular la major puntuació, segons el mode seleccionat. ───────────────────────────────────────────────────────── 🕹 Modalitats Disponibles • Jugadors: 2 a 4 • Modes: Tots contra tots (últim en peu), 2 vs 2 (respawn habilitat) • Límite de temps: 8 minuts ───────────────────────────────────────────────────────── 🚀 Dinàmica i Armes • Bala petita i ràpida → alta cadència, velocitat ~800 m/s • Bala mitjana → equilibri dany/velocitat ~500 m/s • Bala gran i lenta → alt dany, velocitat ~100 m/s ───────────────────────────────────────────────────────── 🎯 Condicions de Victòria • 10 punts per dron eliminat • 1 punt per obstacle destruit ───────────────────────────────────────────────────────── “Una experiència immersiva on estratègia i habilitat es combinen en batalles de drons plenes d’emoció.”

# gameManual
source: 📖 Game Manual ───────────────────────────────────────────────────────── OBJECTIVE Eliminate opponents and be the last drone standing, or collect the most points before time runs out. ───────────────────────────────────────────────────────── SETUP • Players: 2–4 ───────────────────────────────────────────────────────── GAME MODE • Real-world arena • Free-for-all / 2 vs 2 ───────────────────────────────────────────────────────── FIRING MECHANICS Projectile | Rate | Reload | Speed ----------------------|------------|----------|------- Small Fast Bullet | 0.5 s/shot | 0.5 s | 800 m/s Medium Bullet | 1 s/shot | 1 s | 500 m/s Large Slow Bullet | 2 s/shot | 1 s | 100 m/s ───────────────────────────────────────────────────────── OBSTACLES Destructible structures grant 1 extra point when destroyed. ───────────────────────────────────────────────────────── SCORING • 10 pts per elimination • 1 pt per obstacle ───────────────────────────────────────────────────────── END OF GAME A results table shows kills, shots fired, obstacles destroyed, and total points. Good luck and may the best pilot win!
ca: 📖 Manual del Joc ───────────────────────────────────────────────────────── OBJECTIU Eliminar els oponents i ser l’últim dron en peu, o acumular la major puntuació abans que s’acabi el temps. ───────────────────────────────────────────────────────── CONFIGURACIÓ • Jugadors: 2–4 ───────────────────────────────────────────────────────── MODE DE JOC • Escenari real • Tots contra tots / 2 vs 2 ───────────────────────────────────────────────────────── MECÀNICA DE DISPAR Projectil | Cadència | Recàrrega | Velocitat ----------------------|-------------|----------|--------- Bala petita i ràpida | 0,5 s/trets | 0,5 s | 800 m/s Bala mitjana | 1 s/trets | 1 s | 500 m/s Bala gran i lenta | 2 s/trets | 1 s | 100 m/s ───────────────────────────────────────────────────────── OBSTACLES Estructures destructibles atorguen 1 punt extra al destruir-les. ───────────────────────────────────────────────────────── PUNTUACIÓ • 10 pts per eliminació • 1 pt per obstacle ───────────────────────────────────────────────────────── FINAL DE LA PARTIDA Es mostra una taula de resultats amb eliminacions, trets, obstacles destruïts i punts totals. Bona sort i que guanyi el millor pilot!

# accessDeniedContent
source: You are not authorized to play the competition.
ca: No tens permís per unir-te a la competició.

# okButton
source: OK
ca: D'acord

# zoneClear
source: Clear map
ca: Netejar mapa

# distanceToPoint
source: Distance to point: {distance}
ca: Distància al punt indicat: {distance}

source: Clear distance
ca: Netejar distància

source: Selected destination
ca: Destinació seleccionada

source: How to get there
ca: Com arribar-hi

source: My location
ca: La meva ubicació

# locationError
source: Error getting location: {error}
ca: Error obtenint ubicació: {error}

# mapsUnavailable
source: Maps unavailable on this platform
ca: Mapa no disponible en aquesta plataforma

# openExternally
source: Open in external map
ca: Obrir en Google Maps

# dodgePlayButton
source: Play
ca: Jugar

# livesLabel
source: Lives: {lives}
ca: Vides: {lives}

# scoreLabel
source: Score: {score}
ca: Puntuació: {score}

# finalScore
source: Final Score: {score}
ca: Puntuació final: {score}

# restartButton
source: Restart
ca: Reiniciar

# exitButton
source: Back
ca: Enrere

# warHeading
source: Drone Warfare!
ca: ¡Guerra de Drons!
